HiMyCocoo/air-quality-monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
# CONFIG_BT_NIMBLE_GATT_CLIENT is not set
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT is not set
# CONFIG_BT_NIMBLE_PROX_SERVICE is not set
# CONFIG_BT_NIMBLE_ANS_SERVICE is not set
# CONFIG_BT_NIMBLE_CTS_SERVICE is not set
# CONFIG_BT_NIMBLE_HTP_SERVICE is not set
# CONFIG_BT_NIMBLE_IPSS_SERVICE is not set
# CONFIG_BT_NIMBLE_TPS_SERVICE is not set
# CONFIG_BT_NIMBLE_IAS_SERVICE is not set
# CONFIG_BT_NIMBLE_LLS_SERVICE is not set
# CONFIG_BT_NIMBLE_SPS_SERVICE is not set
# CONFIG_BT_NIMBLE_HR_SERVICE is not set
# CONFIG_BT_NIMBLE_BAS_SERVICE is not set
# CONFIG_BT_NIMBLE_DIS_SERVICE is not set
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
# CONFIG_MQTT_TRANSPORT_WEBSOCKET is not set
# CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE is not set
CONFIG_AIRMON_GITHUB_OTA_ENABLED=y
CONFIG_AIRMON_SCD41_I2C_PORT_NUM=0
CONFIG_AIRMON_SCD41_I2C_SDA_GPIO=8
CONFIG_AIRMON_SCD41_I2C_SCL_GPIO=9
CONFIG_AIRMON_SGP41_I2C_PORT_NUM=0
CONFIG_AIRMON_SGP41_I2C_SDA_GPIO=8
CONFIG_AIRMON_SGP41_I2C_SCL_GPIO=9
CONFIG_AIRMON_BMP390_I2C_PORT_NUM=0
CONFIG_AIRMON_BMP390_I2C_SDA_GPIO=8
CONFIG_AIRMON_BMP390_I2C_SCL_GPIO=9
CONFIG_AIRMON_BMP390_I2C_ADDRESS=0x77
CONFIG_AIRMON_SPS30_UART_PORT_NUM=1
CONFIG_AIRMON_SPS30_UART_TX_GPIO=17
CONFIG_AIRMON_SPS30_UART_RX_GPIO=18
CONFIG_AIRMON_SPS30_UART_BAUD_RATE=115200
CONFIG_AIRMON_SPS30_AUTO_CLEANING_INTERVAL_SEC=604800

CONFIG_LWIP_SNTP_MAX_SERVERS=2
